app/views/questions/_form.html.erb

SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC
---
        <%= f.label :category%>
        <%= f.collection_select :category_id, Category.order(:name), :id, :name%>