app/views/questions/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."question_id" = $1  [["question_id", 4]]
---
<% end%>
(<%= @question.likes.count%>) |

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 11]]
---
<div id="answers">
  <% @question.answers.each do |answer| %>