app/controllers/answers_controller.rb

  def create
    #to make sure that the question_id exit and
    #finding record do not need to use strong params
    @question = Question.find params[:question_id]
    #below is strong Parameters which only use for creating record
    answer_params = params.require(:answer).permit([:body])
    #create new record but wont create question_id
    @answer = Answer.new answer_params
    #create question_id in this answer record
    @answer.question = @question
    @answer.user = current_user
    respond_to do |format|
        if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "answers" ("body", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sadfsdaf"], ["question_id", 12], ["user_id", 4], ["created_at", "2016-04-15 18:56:17.927419"], ["updated_at", "2016-04-15 18:56:17.927419"]]

  def destroy
    #find the question otherwise cant go back
    # question = Question.find params[:question_id]
    # #to delete answer only the answers in that question
    # answer = question.answers.find params[:id]
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 19]]

  def find_question
    @question = Question.find params[:question_id]
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 11]]

  def find_and_authorize_answer
     @answer = @question.answers.find params[:id]
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 AND "answers"."id" = $2 LIMIT 1  [["question_id", 224], ["id", 1030]]