app/controllers/likes_controller.rb

  def create
    question = Question.find params[:question_id]
    like = Like.new
    like.user = current_user
    like.question = question
    respond_to do |format|
    if like.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "likes" ("user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["question_id", 4], ["created_at", "2016-04-21 18:04:22.713876"], ["updated_at", "2016-04-21 18:04:22.713876"]]

  def destroy
    question = Question.find params[:question_id]
    like = Like.find params[:id]
    like.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 7]]