app/controllers/questions_controller.rb

  def create
    # Method 1
    # @question       = Question.new
    # @question.title = params[:question][:title]
    # @question.body  = params[:question][:body]
    # @question.save!

    # Method 2
    # @question = Question.create({title: params[:question][:title],
    #                              body:  params[:question][:body]})

    # Method 3
    # params[:question] looks like: {"title"=>"question from web", "body"=>"question body from web"}
    # @question = Question.create(params[:question])
    # this will throw a: ActiveModel::ForbiddenAttributesError exception


    # Method 4
    # we use Strong Parameters feature of Rails
    @question       = Question.new(question_params)
    @question.user  = current_user
    if @question.save
---
INSERT INTO "questions" ("title", "body", "view_count", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Asdfasdfdsafdsa"], ["body", "asdfsdafsdafsa"], ["view_count", 0], ["user_id", 5], ["created_at", "2016-04-18 21:09:47.516805"], ["updated_at", "2016-04-18 21:09:47.516805"]]

  def update
    if @question.update question_params
---
UPDATE "questions" SET "view_count" = $1, "body" = $2, "title" = $3, "updated_at" = $4 WHERE "questions"."id" = $5  [["view_count", 0], ["body", "asdfsa"], ["title", "My First Question"], ["updated_at", "2016-04-12 16:57:10.900690"], ["id", 1]]

  def find_question
    @question = Question.find params[:id]
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 119]]

  def find_owned_question
    @question = current_user.questions.find params[:id]
---
SELECT  "questions".* FROM "questions" WHERE "questions"."user_id" = $1 AND "questions"."id" = $2 LIMIT 1  [["user_id", 5], ["id", 11]]