app/controllers/sessions_controller.rb

def create
  #find the user by email
  user = User.find_by_email params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "abc@abc.com"]]